Q-1

Here are the five functions in pandas

In [2]:
# read_csv - first function
import pandas as pd 
df = pd.read_csv("student.csv") 
print(df)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [3]:
# head - second function 
df.head() 
# which displays the first five tuples in a data frame

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [4]:
# tail- third function 
df.tail() 
# which results in showing the last five tuples in a fata frame

    id         name  class  mark  gender
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

In [5]:
# describe - fourth function 
df.describe() 
# describe which results in showing up of basic mathematical fucntions 
# of only numerical data type

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

In [8]:
# read_excel 
fg = pd.read_excel("student.xlsx") 
print(fg) 
# This properety read the file that is in excel format

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob   Five    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow    Six    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

Q-2

In [4]:
import pandas as pd 


def reindex_dataframe(df):
    # Create a new index starting from 1 and incrementing by 2
    new_index = range(1, len(df) * 2, 2)
    
    # Set the new index to the DataFrame
    df_reindexed = df.set_index(pd.Index(new_index))
    
    return df_reindexed

# Example usage:
# Create a sample DataFrame with columns 'A', 'B', and 'C'
data = {'A': [10, 20, 30],
        'B': [40, 50, 60],
        'C': [70, 80, 90]}

df = pd.DataFrame(data)

# Display the original DataFrame
print("Original DataFrame:")
print(df)

# Call the function to reindex the DataFrame
df_reindexed = reindex_dataframe(df)

# Display the DataFrame after reindexing
print("\nDataFrame after reindexing:")
print(df_reindexed)

Original DataFrame:
    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

DataFrame after reindexing:
    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

Q-3

In [13]:
import pandas as pd 
def return_sum(df):
    temp = 0
    for i in range(3):
        temp += df.loc[i] # Itering the row values 
    return temp # returning the sum of first three values

pdx = {
    "Values":[12,13,45,78,90,32,54]
}

df = pd.DataFrame(pdx)
x = return_sum(df)
print(x)

Values    70
Name: 0, dtype: int64

Q-4

In [43]:
import pandas as pd

def add_word_count_column(df, text_column_name='Text', new_column_name='Word_Count'):
    # Function to count the number of words in a text
    def count_words(text):
        words = str(text).split()
        return len(words)

    # Apply the function to create the new column
    df[new_column_name] = df[text_column_name].apply(count_words)

    return df

# Example usage:
# Create a sample DataFrame
data = {'Text': ['Hello, world!', 'Python is awesome', 'Data Science is interesting']}
df1 = pd.DataFrame(data)

# Call the function to add the 'Word_Count' column
df1 = add_word_count_column(df)

# Display the updated DataFrame
print(df1)

                          Text  Word_Count
0                Hello, world!           2
1            Python is awesome           3
2  Data Science is interesting           4

Q-5

In [45]:
import pandas as pd

pdf = {
    "A":[1,2,3,4,5,6], 
    "B" :[12,13,14,15,16, 17]
} 

df = pd.DataFrame(pdf)

df.size # It refers to size of the total data frame columns

12

In [46]:
df.shape # It refer to pair of values with first value containing number of tuples and second value containing number of columns

(6, 2)

Q-6

In [48]:
# we use pd.read_excel("File.xlsx") fucntion to read pandas 
import pandas as pd 
df = pd.read_excel("student.xlsx") 
print(df)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob   Five    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow    Six    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

Q-7

In [27]:
import pandas as pd  

def user_name(df7):
    for i in range(len(df7)):
        x = df7["Email"][i]
        y = x.split("@")
        df7["Username"][i] = y[0]
    



f7 = {
    "Email":["joe@domain.com", "mathew@domain.com", "root@domain.com",
            "messi@domain.com","anderson@domain.com","david@domain.com"] 
} 
df7 = pd.DataFrame(f7)  
df7["Username"] = None
user_name(df7) 
print(df7)

                 Email  Username
0       joe@domain.com       joe
1    mathew@domain.com    mathew
2      root@domain.com      root
3     messi@domain.com     messi
4  anderson@domain.com  anderson
5     david@domain.com     david

Q-8

In [32]:
import pandas as pd  

def arth(df8):
    lsn = df8[(df8["A"]>5) & (df8["B"]<10)]
    print(lsn)
    
    

f8 = { "A":[1,3,5,7,9,12,34,90],
       "B":[4,5,6,2,3,14,17,18],
      "C":[23,24,25,26,27,28,30,34]
} 
df8 = pd.DataFrame(f8)  
arth(df8)

   A  B   C
3  7  2  26
4  9  3  27

Q-9

In [47]:
import pandas as pd

def calculate_statistics(df):
    # Check if the 'Values' column exists in the DataFrame
    if 'Values' not in df.columns:
        return "Error: 'Values' column not found in the DataFrame."

    # Calculate mean, median, and standard deviation
    mean_value = df['Values'].mean()
    median_value = df['Values'].median()
    std_deviation = df['Values'].std()

    # Create a dictionary to store the results
    result_dict = {
        'Mean': mean_value,
        'Median': median_value,
        'Standard Deviation': std_deviation
    }

    return result_dict



f9 = {
    "Values":[1,2,3,4,5,6,7,12,120]
}

df9 = pd.DataFrame(f9)
new_df9 = calculate_statistics(df9)
print(new_df9)

{'Mean': 17.77777777777778, 'Median': 5.0, 'Standard Deviation': 38.470046067615314}

Q-10

In [52]:
import pandas as pd 



def calculate_moving_average(df):
    # Check if the required columns exist in the DataFrame
    if 'Sales' not in df.columns or 'Date' not in df.columns:
        return "Error: 'Sales' and 'Date' columns are required in the DataFrame."

    # Sort the DataFrame by the 'Date' column
    df.sort_values(by='Date', inplace=True)

    # Calculate the moving average using a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df

# Example usage:
# Assuming 'df' is your DataFrame
# df = calculate_moving_average(df)
# print(df)









f10 = {
    "Sales":[12,23,45,67,12,33,22,90,100],
    "Date":[1-12-2023, 2-12-2023, 3-12-2023,4-12-2023,
           5-12-2023,6-12-2023,7-12-2023,8-12-2023,
           9-12-2023]
}

df10 = pd.DataFrame(f10) 
new_df10 = calculate_moving_average(df10)
print(new_df10)

   Sales  Date  MovingAverage
0     12 -2034      12.000000
1     23 -2033      17.500000
2     45 -2032      26.666667
3     67 -2031      36.750000
4     12 -2030      31.800000
5     33 -2029      32.000000
6     22 -2028      30.571429
7     90 -2027      41.714286
8    100 -2026      52.714286

Q-11

In [59]:
import pandas as pd

def add_weekday_column(df):
    # Check if the 'Date' column exists in the DataFrame
    if 'Date' not in df.columns:
        return "Error: 'Date' column not found in the DataFrame."

    # Convert the 'Date' column to datetime if it's not already
    df['new_Date'] = pd.to_datetime(df['Date'])

    # Add a new 'Weekday' column with the weekday names
    df['Weekday'] = df['new_Date'].dt.day_name()

    return df

f11 = {
    "Date":[2023-12-78, 2021-17-2, 2022-12-4, 2023-9-8, 2023-3-12, 2022-5-13]
}
df11 = pd.DataFrame(f11)
new_df11 = add_weekday_column(df11)
print(new_df11)

   Date                      new_Date   Weekday
0  1933 1970-01-01 00:00:00.000001933  Thursday
1  2002 1970-01-01 00:00:00.000002002  Thursday
2  2006 1970-01-01 00:00:00.000002006  Thursday
3  2006 1970-01-01 00:00:00.000002006  Thursday
4  2008 1970-01-01 00:00:00.000002008  Thursday
5  2004 1970-01-01 00:00:00.000002004  Thursday

Q-12

In [67]:
import pandas as pd

# Sample DataFrame with 'Date' column containing timestamps
data = {'Date': [2023-1-13, 2022-1-24, 2020-1-14, 2019-12-4,
                2021-12-4, 2016-1-4, 2017-12-4, 2018-12-4,
                ],
        'Value': [1,2,3,4,5,6,7,8]}

df = pd.DataFrame(data)

# Function to filter rows based on date range
def filter_date_range(df, start_date, end_date):
    df['Date'] = pd.to_datetime(df['Date'])  # Convert 'Date' column to datetime
    filtered_df = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)].copy()  # Make a copy to avoid SettingWithCopyWarning
    return filtered_df

# Specify the date range
start_date = '2023-01-01'
end_date = '2023-01-31'

# Filter DataFrame based on the date range
filtered_df = filter_date_range(df, start_date, end_date)

# Print the result
print(filtered_df)

Empty DataFrame
Columns: [Date, Value]
Index: []

Q-13

To use basic functions of pandas we need implement the statement 
"import pandas as pd".With this we import pandas libary as we use the fucntions of pandas with the alias name pd like,  
"pd.read_csv("File.csv")" which reads the data in csv format.
An example is given below

In [2]:
import pandas as pd 
dff = pd.read_csv("student.csv")
print(dff)

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female